backend/product-service/tests/load-test.yml
config:
  target: 'http://localhost:5001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Product Service Load Test"
    weight: 100
    flow:
      - get:
          url: "/health"
      - get:
          url: "/api/products"
      - get:
          url: "/api/products/1"
      - post:
          url: "/api/products"
          json:
            name: "Test Product {{ $randomString() }}"
            description: "Test Description"
            price: 9.99
            category: "test"